In [1]:
import numpy as np
import pandas as pd

In [27]:
df=pd.DataFrame({"A":[1,2,3,np.nan],
                "B":[0.6,np.nan,np.nan,np.nan],
                "C":[0.2,0.6,np.nan,np.nan],
                "D":[np.nan,np.nan,np.nan,np.nan]})

In [28]:
df

     A    B    C   D
0  1.0  0.6  0.2 NaN
1  2.0  NaN  0.6 NaN
2  3.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [24]:
df.dropna()

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [25]:
df.dropna(axis=0)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [26]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [7]:
df

     A    B    C   D
0  1.0  0.6  0.2 NaN
1  2.0  NaN  0.6 NaN
2  3.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [8]:
df.fillna(99)

      A     B     C     D
0   1.0   0.6   0.2  99.0
1   2.0  99.0   0.6  99.0
2   3.0  99.0  99.0  99.0
3  99.0  99.0  99.0  99.0

In [9]:
df.mean()

A    2.0
B    0.6
C    0.4
D    NaN
dtype: float64

In [10]:
df.median()

A    2.0
B    0.6
C    0.4
D    NaN
dtype: float64

In [11]:
df.std()

A    1.000000
B         NaN
C    0.282843
D         NaN
dtype: float64

In [12]:
df.max()

A    3.0
B    0.6
C    0.6
D    NaN
dtype: float64

In [13]:
df["A"].mean()

2.0

In [14]:
df["A"].median()

2.0

In [29]:
df

     A    B    C   D
0  1.0  0.6  0.2 NaN
1  2.0  NaN  0.6 NaN
2  3.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [31]:
df['A'].fillna(value=df['A'].mean(),inplace=True)

In [32]:
df

     A    B    C   D
0  1.0  0.6  0.2 NaN
1  2.0  NaN  0.6 NaN
2  3.0  NaN  NaN NaN
3  2.0  NaN  NaN NaN

In [33]:
df['C'].fillna(value=df['A'].mean(),inplace=True)

In [34]:
df

     A    B    C   D
0  1.0  0.6  0.2 NaN
1  2.0  NaN  0.6 NaN
2  3.0  NaN  2.0 NaN
3  2.0  NaN  2.0 NaN